load-test-results/up-to-1-sec-delay-service-layer-all-endpoints-100k-requests-200-concurrent-users.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        17796 bytes

Concurrency Level:      200
Time taken for tests:   406.720 seconds
Complete requests:      100000
Failed requests:        99377
   (Connect: 0, Receive: 0, Length: 99377, Exceptions: 0)
Total transferred:      1787956018 bytes
HTML transferred:       1777456018 bytes
Requests per second:    245.87 [#/sec] (mean)
Time per request:       813.440 [ms] (mean)
Time per request:       4.067 [ms] (mean, across all concurrent requests)
Transfer rate:          4293.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       8
Processing:    57  811 163.6    851    1424
Waiting:       57  810 163.6    850    1424
Total:         57  811 163.6    851    1431

Percentage of the requests served within a certain time (ms)
  50%    851
  66%    912
  75%    942
  80%    957
  90%    984
  95%    998
  98%   1008
  99%   1017
 100%   1431 (longest request)