load-test-results/up-to-100-millies-delays-service-layer-endpoints-100k-requests-200-concurrent-users.txt
ab -n 100000 -c 200 http://localhost:8080/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        17845 bytes

Concurrency Level:      200
Time taken for tests:   108.915 seconds
Complete requests:      100000
Failed requests:        99671
   (Connect: 0, Receive: 0, Length: 99671, Exceptions: 0)
Total transferred:      1787961775 bytes
HTML transferred:       1777461775 bytes
Requests per second:    918.15 [#/sec] (mean)
Time per request:       217.830 [ms] (mean)
Time per request:       1.089 [ms] (mean, across all concurrent requests)
Transfer rate:          16031.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0      11
Processing:    56  217  42.2    215     738
Waiting:       56  217  42.2    215     737
Total:         56  217  42.2    216     744

Percentage of the requests served within a certain time (ms)
  50%    216
  66%    232
  75%    243
  80%    250
  90%    270
  95%    286
  98%    306
  99%    323
 100%    744 (longest request)